/* automatically generated by rust-bindgen 0.59.2 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: size_t) -> size_t;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: size_t,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: size_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: size_t);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type ssize_t = __ssize_t;
pub type gid_t = __gid_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type useconds_t = __useconds_t;
pub type pid_t = __pid_t;
pub type socklen_t = __socklen_t;
extern "C" {
    pub fn access(
        __name: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn faccessat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __type: ::std::os::raw::c_int,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lseek(
        __fd: ::std::os::raw::c_int,
        __offset: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> __off_t;
}
extern "C" {
    pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn read(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: size_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn write(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn pread(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __nbytes: size_t,
        __offset: __off_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn pwrite(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
        __offset: __off_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn ualarm(__value: __useconds_t, __interval: __useconds_t) -> __useconds_t;
}
extern "C" {
    pub fn usleep(__useconds: __useconds_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pause() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchown(
        __fd: ::std::os::raw::c_int,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lchown(
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchownat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __owner: __uid_t,
        __group: __gid_t,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchdir(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getcwd(
        __buf: *mut ::std::os::raw::c_char,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getwd(__buf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dup2(__fd: ::std::os::raw::c_int, __fd2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __environ: *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn execve(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fexecve(
        __fd: ::std::os::raw::c_int,
        __argv: *const *mut ::std::os::raw::c_char,
        __envp: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execv(
        __path: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execle(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execl(
        __path: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execvp(
        __file: *const ::std::os::raw::c_char,
        __argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn execlp(
        __file: *const ::std::os::raw::c_char,
        __arg: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nice(__inc: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _exit(__status: ::std::os::raw::c_int);
}
pub const _PC_LINK_MAX: ::std::os::raw::c_uint = 0;
pub const _PC_MAX_CANON: ::std::os::raw::c_uint = 1;
pub const _PC_MAX_INPUT: ::std::os::raw::c_uint = 2;
pub const _PC_NAME_MAX: ::std::os::raw::c_uint = 3;
pub const _PC_PATH_MAX: ::std::os::raw::c_uint = 4;
pub const _PC_PIPE_BUF: ::std::os::raw::c_uint = 5;
pub const _PC_CHOWN_RESTRICTED: ::std::os::raw::c_uint = 6;
pub const _PC_NO_TRUNC: ::std::os::raw::c_uint = 7;
pub const _PC_VDISABLE: ::std::os::raw::c_uint = 8;
pub const _PC_SYNC_IO: ::std::os::raw::c_uint = 9;
pub const _PC_ASYNC_IO: ::std::os::raw::c_uint = 10;
pub const _PC_PRIO_IO: ::std::os::raw::c_uint = 11;
pub const _PC_SOCK_MAXBUF: ::std::os::raw::c_uint = 12;
pub const _PC_FILESIZEBITS: ::std::os::raw::c_uint = 13;
pub const _PC_REC_INCR_XFER_SIZE: ::std::os::raw::c_uint = 14;
pub const _PC_REC_MAX_XFER_SIZE: ::std::os::raw::c_uint = 15;
pub const _PC_REC_MIN_XFER_SIZE: ::std::os::raw::c_uint = 16;
pub const _PC_REC_XFER_ALIGN: ::std::os::raw::c_uint = 17;
pub const _PC_ALLOC_SIZE_MIN: ::std::os::raw::c_uint = 18;
pub const _PC_SYMLINK_MAX: ::std::os::raw::c_uint = 19;
pub const _PC_2_SYMLINKS: ::std::os::raw::c_uint = 20;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const _SC_ARG_MAX: ::std::os::raw::c_uint = 0;
pub const _SC_CHILD_MAX: ::std::os::raw::c_uint = 1;
pub const _SC_CLK_TCK: ::std::os::raw::c_uint = 2;
pub const _SC_NGROUPS_MAX: ::std::os::raw::c_uint = 3;
pub const _SC_OPEN_MAX: ::std::os::raw::c_uint = 4;
pub const _SC_STREAM_MAX: ::std::os::raw::c_uint = 5;
pub const _SC_TZNAME_MAX: ::std::os::raw::c_uint = 6;
pub const _SC_JOB_CONTROL: ::std::os::raw::c_uint = 7;
pub const _SC_SAVED_IDS: ::std::os::raw::c_uint = 8;
pub const _SC_REALTIME_SIGNALS: ::std::os::raw::c_uint = 9;
pub const _SC_PRIORITY_SCHEDULING: ::std::os::raw::c_uint = 10;
pub const _SC_TIMERS: ::std::os::raw::c_uint = 11;
pub const _SC_ASYNCHRONOUS_IO: ::std::os::raw::c_uint = 12;
pub const _SC_PRIORITIZED_IO: ::std::os::raw::c_uint = 13;
pub const _SC_SYNCHRONIZED_IO: ::std::os::raw::c_uint = 14;
pub const _SC_FSYNC: ::std::os::raw::c_uint = 15;
pub const _SC_MAPPED_FILES: ::std::os::raw::c_uint = 16;
pub const _SC_MEMLOCK: ::std::os::raw::c_uint = 17;
pub const _SC_MEMLOCK_RANGE: ::std::os::raw::c_uint = 18;
pub const _SC_MEMORY_PROTECTION: ::std::os::raw::c_uint = 19;
pub const _SC_MESSAGE_PASSING: ::std::os::raw::c_uint = 20;
pub const _SC_SEMAPHORES: ::std::os::raw::c_uint = 21;
pub const _SC_SHARED_MEMORY_OBJECTS: ::std::os::raw::c_uint = 22;
pub const _SC_AIO_LISTIO_MAX: ::std::os::raw::c_uint = 23;
pub const _SC_AIO_MAX: ::std::os::raw::c_uint = 24;
pub const _SC_AIO_PRIO_DELTA_MAX: ::std::os::raw::c_uint = 25;
pub const _SC_DELAYTIMER_MAX: ::std::os::raw::c_uint = 26;
pub const _SC_MQ_OPEN_MAX: ::std::os::raw::c_uint = 27;
pub const _SC_MQ_PRIO_MAX: ::std::os::raw::c_uint = 28;
pub const _SC_VERSION: ::std::os::raw::c_uint = 29;
pub const _SC_PAGESIZE: ::std::os::raw::c_uint = 30;
pub const _SC_RTSIG_MAX: ::std::os::raw::c_uint = 31;
pub const _SC_SEM_NSEMS_MAX: ::std::os::raw::c_uint = 32;
pub const _SC_SEM_VALUE_MAX: ::std::os::raw::c_uint = 33;
pub const _SC_SIGQUEUE_MAX: ::std::os::raw::c_uint = 34;
pub const _SC_TIMER_MAX: ::std::os::raw::c_uint = 35;
pub const _SC_BC_BASE_MAX: ::std::os::raw::c_uint = 36;
pub const _SC_BC_DIM_MAX: ::std::os::raw::c_uint = 37;
pub const _SC_BC_SCALE_MAX: ::std::os::raw::c_uint = 38;
pub const _SC_BC_STRING_MAX: ::std::os::raw::c_uint = 39;
pub const _SC_COLL_WEIGHTS_MAX: ::std::os::raw::c_uint = 40;
pub const _SC_EQUIV_CLASS_MAX: ::std::os::raw::c_uint = 41;
pub const _SC_EXPR_NEST_MAX: ::std::os::raw::c_uint = 42;
pub const _SC_LINE_MAX: ::std::os::raw::c_uint = 43;
pub const _SC_RE_DUP_MAX: ::std::os::raw::c_uint = 44;
pub const _SC_CHARCLASS_NAME_MAX: ::std::os::raw::c_uint = 45;
pub const _SC_2_VERSION: ::std::os::raw::c_uint = 46;
pub const _SC_2_C_BIND: ::std::os::raw::c_uint = 47;
pub const _SC_2_C_DEV: ::std::os::raw::c_uint = 48;
pub const _SC_2_FORT_DEV: ::std::os::raw::c_uint = 49;
pub const _SC_2_FORT_RUN: ::std::os::raw::c_uint = 50;
pub const _SC_2_SW_DEV: ::std::os::raw::c_uint = 51;
pub const _SC_2_LOCALEDEF: ::std::os::raw::c_uint = 52;
pub const _SC_PII: ::std::os::raw::c_uint = 53;
pub const _SC_PII_XTI: ::std::os::raw::c_uint = 54;
pub const _SC_PII_SOCKET: ::std::os::raw::c_uint = 55;
pub const _SC_PII_INTERNET: ::std::os::raw::c_uint = 56;
pub const _SC_PII_OSI: ::std::os::raw::c_uint = 57;
pub const _SC_POLL: ::std::os::raw::c_uint = 58;
pub const _SC_SELECT: ::std::os::raw::c_uint = 59;
pub const _SC_UIO_MAXIOV: ::std::os::raw::c_uint = 60;
pub const _SC_IOV_MAX: ::std::os::raw::c_uint = 60;
pub const _SC_PII_INTERNET_STREAM: ::std::os::raw::c_uint = 61;
pub const _SC_PII_INTERNET_DGRAM: ::std::os::raw::c_uint = 62;
pub const _SC_PII_OSI_COTS: ::std::os::raw::c_uint = 63;
pub const _SC_PII_OSI_CLTS: ::std::os::raw::c_uint = 64;
pub const _SC_PII_OSI_M: ::std::os::raw::c_uint = 65;
pub const _SC_T_IOV_MAX: ::std::os::raw::c_uint = 66;
pub const _SC_THREADS: ::std::os::raw::c_uint = 67;
pub const _SC_THREAD_SAFE_FUNCTIONS: ::std::os::raw::c_uint = 68;
pub const _SC_GETGR_R_SIZE_MAX: ::std::os::raw::c_uint = 69;
pub const _SC_GETPW_R_SIZE_MAX: ::std::os::raw::c_uint = 70;
pub const _SC_LOGIN_NAME_MAX: ::std::os::raw::c_uint = 71;
pub const _SC_TTY_NAME_MAX: ::std::os::raw::c_uint = 72;
pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: ::std::os::raw::c_uint = 73;
pub const _SC_THREAD_KEYS_MAX: ::std::os::raw::c_uint = 74;
pub const _SC_THREAD_STACK_MIN: ::std::os::raw::c_uint = 75;
pub const _SC_THREAD_THREADS_MAX: ::std::os::raw::c_uint = 76;
pub const _SC_THREAD_ATTR_STACKADDR: ::std::os::raw::c_uint = 77;
pub const _SC_THREAD_ATTR_STACKSIZE: ::std::os::raw::c_uint = 78;
pub const _SC_THREAD_PRIORITY_SCHEDULING: ::std::os::raw::c_uint = 79;
pub const _SC_THREAD_PRIO_INHERIT: ::std::os::raw::c_uint = 80;
pub const _SC_THREAD_PRIO_PROTECT: ::std::os::raw::c_uint = 81;
pub const _SC_THREAD_PROCESS_SHARED: ::std::os::raw::c_uint = 82;
pub const _SC_NPROCESSORS_CONF: ::std::os::raw::c_uint = 83;
pub const _SC_NPROCESSORS_ONLN: ::std::os::raw::c_uint = 84;
pub const _SC_PHYS_PAGES: ::std::os::raw::c_uint = 85;
pub const _SC_AVPHYS_PAGES: ::std::os::raw::c_uint = 86;
pub const _SC_ATEXIT_MAX: ::std::os::raw::c_uint = 87;
pub const _SC_PASS_MAX: ::std::os::raw::c_uint = 88;
pub const _SC_XOPEN_VERSION: ::std::os::raw::c_uint = 89;
pub const _SC_XOPEN_XCU_VERSION: ::std::os::raw::c_uint = 90;
pub const _SC_XOPEN_UNIX: ::std::os::raw::c_uint = 91;
pub const _SC_XOPEN_CRYPT: ::std::os::raw::c_uint = 92;
pub const _SC_XOPEN_ENH_I18N: ::std::os::raw::c_uint = 93;
pub const _SC_XOPEN_SHM: ::std::os::raw::c_uint = 94;
pub const _SC_2_CHAR_TERM: ::std::os::raw::c_uint = 95;
pub const _SC_2_C_VERSION: ::std::os::raw::c_uint = 96;
pub const _SC_2_UPE: ::std::os::raw::c_uint = 97;
pub const _SC_XOPEN_XPG2: ::std::os::raw::c_uint = 98;
pub const _SC_XOPEN_XPG3: ::std::os::raw::c_uint = 99;
pub const _SC_XOPEN_XPG4: ::std::os::raw::c_uint = 100;
pub const _SC_CHAR_BIT: ::std::os::raw::c_uint = 101;
pub const _SC_CHAR_MAX: ::std::os::raw::c_uint = 102;
pub const _SC_CHAR_MIN: ::std::os::raw::c_uint = 103;
pub const _SC_INT_MAX: ::std::os::raw::c_uint = 104;
pub const _SC_INT_MIN: ::std::os::raw::c_uint = 105;
pub const _SC_LONG_BIT: ::std::os::raw::c_uint = 106;
pub const _SC_WORD_BIT: ::std::os::raw::c_uint = 107;
pub const _SC_MB_LEN_MAX: ::std::os::raw::c_uint = 108;
pub const _SC_NZERO: ::std::os::raw::c_uint = 109;
pub const _SC_SSIZE_MAX: ::std::os::raw::c_uint = 110;
pub const _SC_SCHAR_MAX: ::std::os::raw::c_uint = 111;
pub const _SC_SCHAR_MIN: ::std::os::raw::c_uint = 112;
pub const _SC_SHRT_MAX: ::std::os::raw::c_uint = 113;
pub const _SC_SHRT_MIN: ::std::os::raw::c_uint = 114;
pub const _SC_UCHAR_MAX: ::std::os::raw::c_uint = 115;
pub const _SC_UINT_MAX: ::std::os::raw::c_uint = 116;
pub const _SC_ULONG_MAX: ::std::os::raw::c_uint = 117;
pub const _SC_USHRT_MAX: ::std::os::raw::c_uint = 118;
pub const _SC_NL_ARGMAX: ::std::os::raw::c_uint = 119;
pub const _SC_NL_LANGMAX: ::std::os::raw::c_uint = 120;
pub const _SC_NL_MSGMAX: ::std::os::raw::c_uint = 121;
pub const _SC_NL_NMAX: ::std::os::raw::c_uint = 122;
pub const _SC_NL_SETMAX: ::std::os::raw::c_uint = 123;
pub const _SC_NL_TEXTMAX: ::std::os::raw::c_uint = 124;
pub const _SC_XBS5_ILP32_OFF32: ::std::os::raw::c_uint = 125;
pub const _SC_XBS5_ILP32_OFFBIG: ::std::os::raw::c_uint = 126;
pub const _SC_XBS5_LP64_OFF64: ::std::os::raw::c_uint = 127;
pub const _SC_XBS5_LPBIG_OFFBIG: ::std::os::raw::c_uint = 128;
pub const _SC_XOPEN_LEGACY: ::std::os::raw::c_uint = 129;
pub const _SC_XOPEN_REALTIME: ::std::os::raw::c_uint = 130;
pub const _SC_XOPEN_REALTIME_THREADS: ::std::os::raw::c_uint = 131;
pub const _SC_ADVISORY_INFO: ::std::os::raw::c_uint = 132;
pub const _SC_BARRIERS: ::std::os::raw::c_uint = 133;
pub const _SC_BASE: ::std::os::raw::c_uint = 134;
pub const _SC_C_LANG_SUPPORT: ::std::os::raw::c_uint = 135;
pub const _SC_C_LANG_SUPPORT_R: ::std::os::raw::c_uint = 136;
pub const _SC_CLOCK_SELECTION: ::std::os::raw::c_uint = 137;
pub const _SC_CPUTIME: ::std::os::raw::c_uint = 138;
pub const _SC_THREAD_CPUTIME: ::std::os::raw::c_uint = 139;
pub const _SC_DEVICE_IO: ::std::os::raw::c_uint = 140;
pub const _SC_DEVICE_SPECIFIC: ::std::os::raw::c_uint = 141;
pub const _SC_DEVICE_SPECIFIC_R: ::std::os::raw::c_uint = 142;
pub const _SC_FD_MGMT: ::std::os::raw::c_uint = 143;
pub const _SC_FIFO: ::std::os::raw::c_uint = 144;
pub const _SC_PIPE: ::std::os::raw::c_uint = 145;
pub const _SC_FILE_ATTRIBUTES: ::std::os::raw::c_uint = 146;
pub const _SC_FILE_LOCKING: ::std::os::raw::c_uint = 147;
pub const _SC_FILE_SYSTEM: ::std::os::raw::c_uint = 148;
pub const _SC_MONOTONIC_CLOCK: ::std::os::raw::c_uint = 149;
pub const _SC_MULTI_PROCESS: ::std::os::raw::c_uint = 150;
pub const _SC_SINGLE_PROCESS: ::std::os::raw::c_uint = 151;
pub const _SC_NETWORKING: ::std::os::raw::c_uint = 152;
pub const _SC_READER_WRITER_LOCKS: ::std::os::raw::c_uint = 153;
pub const _SC_SPIN_LOCKS: ::std::os::raw::c_uint = 154;
pub const _SC_REGEXP: ::std::os::raw::c_uint = 155;
pub const _SC_REGEX_VERSION: ::std::os::raw::c_uint = 156;
pub const _SC_SHELL: ::std::os::raw::c_uint = 157;
pub const _SC_SIGNALS: ::std::os::raw::c_uint = 158;
pub const _SC_SPAWN: ::std::os::raw::c_uint = 159;
pub const _SC_SPORADIC_SERVER: ::std::os::raw::c_uint = 160;
pub const _SC_THREAD_SPORADIC_SERVER: ::std::os::raw::c_uint = 161;
pub const _SC_SYSTEM_DATABASE: ::std::os::raw::c_uint = 162;
pub const _SC_SYSTEM_DATABASE_R: ::std::os::raw::c_uint = 163;
pub const _SC_TIMEOUTS: ::std::os::raw::c_uint = 164;
pub const _SC_TYPED_MEMORY_OBJECTS: ::std::os::raw::c_uint = 165;
pub const _SC_USER_GROUPS: ::std::os::raw::c_uint = 166;
pub const _SC_USER_GROUPS_R: ::std::os::raw::c_uint = 167;
pub const _SC_2_PBS: ::std::os::raw::c_uint = 168;
pub const _SC_2_PBS_ACCOUNTING: ::std::os::raw::c_uint = 169;
pub const _SC_2_PBS_LOCATE: ::std::os::raw::c_uint = 170;
pub const _SC_2_PBS_MESSAGE: ::std::os::raw::c_uint = 171;
pub const _SC_2_PBS_TRACK: ::std::os::raw::c_uint = 172;
pub const _SC_SYMLOOP_MAX: ::std::os::raw::c_uint = 173;
pub const _SC_STREAMS: ::std::os::raw::c_uint = 174;
pub const _SC_2_PBS_CHECKPOINT: ::std::os::raw::c_uint = 175;
pub const _SC_V6_ILP32_OFF32: ::std::os::raw::c_uint = 176;
pub const _SC_V6_ILP32_OFFBIG: ::std::os::raw::c_uint = 177;
pub const _SC_V6_LP64_OFF64: ::std::os::raw::c_uint = 178;
pub const _SC_V6_LPBIG_OFFBIG: ::std::os::raw::c_uint = 179;
pub const _SC_HOST_NAME_MAX: ::std::os::raw::c_uint = 180;
pub const _SC_TRACE: ::std::os::raw::c_uint = 181;
pub const _SC_TRACE_EVENT_FILTER: ::std::os::raw::c_uint = 182;
pub const _SC_TRACE_INHERIT: ::std::os::raw::c_uint = 183;
pub const _SC_TRACE_LOG: ::std::os::raw::c_uint = 184;
pub const _SC_LEVEL1_ICACHE_SIZE: ::std::os::raw::c_uint = 185;
pub const _SC_LEVEL1_ICACHE_ASSOC: ::std::os::raw::c_uint = 186;
pub const _SC_LEVEL1_ICACHE_LINESIZE: ::std::os::raw::c_uint = 187;
pub const _SC_LEVEL1_DCACHE_SIZE: ::std::os::raw::c_uint = 188;
pub const _SC_LEVEL1_DCACHE_ASSOC: ::std::os::raw::c_uint = 189;
pub const _SC_LEVEL1_DCACHE_LINESIZE: ::std::os::raw::c_uint = 190;
pub const _SC_LEVEL2_CACHE_SIZE: ::std::os::raw::c_uint = 191;
pub const _SC_LEVEL2_CACHE_ASSOC: ::std::os::raw::c_uint = 192;
pub const _SC_LEVEL2_CACHE_LINESIZE: ::std::os::raw::c_uint = 193;
pub const _SC_LEVEL3_CACHE_SIZE: ::std::os::raw::c_uint = 194;
pub const _SC_LEVEL3_CACHE_ASSOC: ::std::os::raw::c_uint = 195;
pub const _SC_LEVEL3_CACHE_LINESIZE: ::std::os::raw::c_uint = 196;
pub const _SC_LEVEL4_CACHE_SIZE: ::std::os::raw::c_uint = 197;
pub const _SC_LEVEL4_CACHE_ASSOC: ::std::os::raw::c_uint = 198;
pub const _SC_LEVEL4_CACHE_LINESIZE: ::std::os::raw::c_uint = 199;
pub const _SC_IPV6: ::std::os::raw::c_uint = 235;
pub const _SC_RAW_SOCKETS: ::std::os::raw::c_uint = 236;
pub const _SC_V7_ILP32_OFF32: ::std::os::raw::c_uint = 237;
pub const _SC_V7_ILP32_OFFBIG: ::std::os::raw::c_uint = 238;
pub const _SC_V7_LP64_OFF64: ::std::os::raw::c_uint = 239;
pub const _SC_V7_LPBIG_OFFBIG: ::std::os::raw::c_uint = 240;
pub const _SC_SS_REPL_MAX: ::std::os::raw::c_uint = 241;
pub const _SC_TRACE_EVENT_NAME_MAX: ::std::os::raw::c_uint = 242;
pub const _SC_TRACE_NAME_MAX: ::std::os::raw::c_uint = 243;
pub const _SC_TRACE_SYS_MAX: ::std::os::raw::c_uint = 244;
pub const _SC_TRACE_USER_EVENT_MAX: ::std::os::raw::c_uint = 245;
pub const _SC_XOPEN_STREAMS: ::std::os::raw::c_uint = 246;
pub const _SC_THREAD_ROBUST_PRIO_INHERIT: ::std::os::raw::c_uint = 247;
pub const _SC_THREAD_ROBUST_PRIO_PROTECT: ::std::os::raw::c_uint = 248;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const _CS_PATH: ::std::os::raw::c_uint = 0;
pub const _CS_V6_WIDTH_RESTRICTED_ENVS: ::std::os::raw::c_uint = 1;
pub const _CS_GNU_LIBC_VERSION: ::std::os::raw::c_uint = 2;
pub const _CS_GNU_LIBPTHREAD_VERSION: ::std::os::raw::c_uint = 3;
pub const _CS_V5_WIDTH_RESTRICTED_ENVS: ::std::os::raw::c_uint = 4;
pub const _CS_V7_WIDTH_RESTRICTED_ENVS: ::std::os::raw::c_uint = 5;
pub const _CS_LFS_CFLAGS: ::std::os::raw::c_uint = 1000;
pub const _CS_LFS_LDFLAGS: ::std::os::raw::c_uint = 1001;
pub const _CS_LFS_LIBS: ::std::os::raw::c_uint = 1002;
pub const _CS_LFS_LINTFLAGS: ::std::os::raw::c_uint = 1003;
pub const _CS_LFS64_CFLAGS: ::std::os::raw::c_uint = 1004;
pub const _CS_LFS64_LDFLAGS: ::std::os::raw::c_uint = 1005;
pub const _CS_LFS64_LIBS: ::std::os::raw::c_uint = 1006;
pub const _CS_LFS64_LINTFLAGS: ::std::os::raw::c_uint = 1007;
pub const _CS_XBS5_ILP32_OFF32_CFLAGS: ::std::os::raw::c_uint = 1100;
pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: ::std::os::raw::c_uint = 1101;
pub const _CS_XBS5_ILP32_OFF32_LIBS: ::std::os::raw::c_uint = 1102;
pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: ::std::os::raw::c_uint = 1103;
pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1104;
pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1105;
pub const _CS_XBS5_ILP32_OFFBIG_LIBS: ::std::os::raw::c_uint = 1106;
pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1107;
pub const _CS_XBS5_LP64_OFF64_CFLAGS: ::std::os::raw::c_uint = 1108;
pub const _CS_XBS5_LP64_OFF64_LDFLAGS: ::std::os::raw::c_uint = 1109;
pub const _CS_XBS5_LP64_OFF64_LIBS: ::std::os::raw::c_uint = 1110;
pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: ::std::os::raw::c_uint = 1111;
pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1112;
pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1113;
pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: ::std::os::raw::c_uint = 1114;
pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1115;
pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: ::std::os::raw::c_uint = 1116;
pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: ::std::os::raw::c_uint = 1117;
pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: ::std::os::raw::c_uint = 1118;
pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: ::std::os::raw::c_uint = 1119;
pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1120;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1121;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: ::std::os::raw::c_uint = 1122;
pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1123;
pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: ::std::os::raw::c_uint = 1124;
pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: ::std::os::raw::c_uint = 1125;
pub const _CS_POSIX_V6_LP64_OFF64_LIBS: ::std::os::raw::c_uint = 1126;
pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: ::std::os::raw::c_uint = 1127;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1128;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1129;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: ::std::os::raw::c_uint = 1130;
pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1131;
pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: ::std::os::raw::c_uint = 1132;
pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: ::std::os::raw::c_uint = 1133;
pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: ::std::os::raw::c_uint = 1134;
pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: ::std::os::raw::c_uint = 1135;
pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1136;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1137;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: ::std::os::raw::c_uint = 1138;
pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1139;
pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: ::std::os::raw::c_uint = 1140;
pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: ::std::os::raw::c_uint = 1141;
pub const _CS_POSIX_V7_LP64_OFF64_LIBS: ::std::os::raw::c_uint = 1142;
pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: ::std::os::raw::c_uint = 1143;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: ::std::os::raw::c_uint = 1144;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: ::std::os::raw::c_uint = 1145;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: ::std::os::raw::c_uint = 1146;
pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: ::std::os::raw::c_uint = 1147;
pub const _CS_V6_ENV: ::std::os::raw::c_uint = 1148;
pub const _CS_V7_ENV: ::std::os::raw::c_uint = 1149;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn pathconf(
        __path: *const ::std::os::raw::c_char,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn fpathconf(
        __fd: ::std::os::raw::c_int,
        __name: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn confstr(
        __name: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> size_t;
}
extern "C" {
    pub fn getpid() -> __pid_t;
}
extern "C" {
    pub fn getppid() -> __pid_t;
}
extern "C" {
    pub fn getpgrp() -> __pid_t;
}
extern "C" {
    pub fn __getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getpgid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpgrp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsid() -> __pid_t;
}
extern "C" {
    pub fn getsid(__pid: __pid_t) -> __pid_t;
}
extern "C" {
    pub fn getuid() -> __uid_t;
}
extern "C" {
    pub fn geteuid() -> __uid_t;
}
extern "C" {
    pub fn getgid() -> __gid_t;
}
extern "C" {
    pub fn getegid() -> __gid_t;
}
extern "C" {
    pub fn getgroups(__size: ::std::os::raw::c_int, __list: *mut __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setreuid(__ruid: __uid_t, __euid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seteuid(__uid: __uid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setregid(__rgid: __gid_t, __egid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setegid(__gid: __gid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fork() -> __pid_t;
}
extern "C" {
    pub fn vfork() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ttyname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ttyslot() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn link(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn linkat(
        __fromfd: ::std::os::raw::c_int,
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn symlink(
        __from: *const ::std::os::raw::c_char,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlink(
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn symlinkat(
        __from: *const ::std::os::raw::c_char,
        __tofd: ::std::os::raw::c_int,
        __to: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readlinkat(
        __fd: ::std::os::raw::c_int,
        __path: *const ::std::os::raw::c_char,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlinkat(
        __fd: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
}
extern "C" {
    pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getlogin() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getlogin_r(
        __name: *mut ::std::os::raw::c_char,
        __name_len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setlogin(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut optind: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut opterr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut optopt: ::std::os::raw::c_int;
}
extern "C" {
    pub fn getopt(
        ___argc: ::std::os::raw::c_int,
        ___argv: *const *mut ::std::os::raw::c_char,
        __shortopts: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostname(__name: *mut ::std::os::raw::c_char, __len: size_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostname(
        __name: *const ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sethostid(__id: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdomainname(
        __name: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setdomainname(
        __name: *const ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vhangup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn revoke(__file: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn profil(
        __sample_buffer: *mut ::std::os::raw::c_ushort,
        __size: size_t,
        __offset: size_t,
        __scale: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acct(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getusershell() -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn endusershell();
}
extern "C" {
    pub fn setusershell();
}
extern "C" {
    pub fn daemon(
        __nochdir: ::std::os::raw::c_int,
        __noclose: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chroot(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpass(__prompt: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostid() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn sync();
}
extern "C" {
    pub fn getpagesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdtablesize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn truncate(
        __file: *const ::std::os::raw::c_char,
        __length: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftruncate(__fd: ::std::os::raw::c_int, __length: __off_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn brk(__addr: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sbrk(__delta: isize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn syscall(__sysno: ::std::os::raw::c_long, ...) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lockf(
        __fd: ::std::os::raw::c_int,
        __cmd: ::std::os::raw::c_int,
        __len: __off_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdatasync(__fildes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn crypt(
        __key: *const ::std::os::raw::c_char,
        __salt: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn getentropy(
        __buffer: *mut ::std::os::raw::c_void,
        __length: size_t,
    ) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = [u64; 4usize];
pub type __gnuc_va_list = [u64; 4usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: [u64; 4usize],
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type xen_pfn_t = u64;
pub type xen_ulong_t = u64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_core_regs {
    pub __bindgen_anon_1: vcpu_guest_core_regs__bindgen_ty_1,
    pub __bindgen_anon_2: vcpu_guest_core_regs__bindgen_ty_2,
    pub __bindgen_anon_3: vcpu_guest_core_regs__bindgen_ty_3,
    pub __bindgen_anon_4: vcpu_guest_core_regs__bindgen_ty_4,
    pub __bindgen_anon_5: vcpu_guest_core_regs__bindgen_ty_5,
    pub __bindgen_anon_6: vcpu_guest_core_regs__bindgen_ty_6,
    pub __bindgen_anon_7: vcpu_guest_core_regs__bindgen_ty_7,
    pub __bindgen_anon_8: vcpu_guest_core_regs__bindgen_ty_8,
    pub __bindgen_anon_9: vcpu_guest_core_regs__bindgen_ty_9,
    pub __bindgen_anon_10: vcpu_guest_core_regs__bindgen_ty_10,
    pub __bindgen_anon_11: vcpu_guest_core_regs__bindgen_ty_11,
    pub __bindgen_anon_12: vcpu_guest_core_regs__bindgen_ty_12,
    pub __bindgen_anon_13: vcpu_guest_core_regs__bindgen_ty_13,
    pub __bindgen_anon_14: vcpu_guest_core_regs__bindgen_ty_14,
    pub __bindgen_anon_15: vcpu_guest_core_regs__bindgen_ty_15,
    pub __bindgen_anon_16: vcpu_guest_core_regs__bindgen_ty_16,
    pub __bindgen_anon_17: vcpu_guest_core_regs__bindgen_ty_17,
    pub __bindgen_anon_18: vcpu_guest_core_regs__bindgen_ty_18,
    pub __bindgen_anon_19: vcpu_guest_core_regs__bindgen_ty_19,
    pub __bindgen_anon_20: vcpu_guest_core_regs__bindgen_ty_20,
    pub __bindgen_anon_21: vcpu_guest_core_regs__bindgen_ty_21,
    pub __bindgen_anon_22: vcpu_guest_core_regs__bindgen_ty_22,
    pub __bindgen_anon_23: vcpu_guest_core_regs__bindgen_ty_23,
    pub __bindgen_anon_24: vcpu_guest_core_regs__bindgen_ty_24,
    pub __bindgen_anon_25: vcpu_guest_core_regs__bindgen_ty_25,
    pub __bindgen_anon_26: vcpu_guest_core_regs__bindgen_ty_26,
    pub __bindgen_anon_27: vcpu_guest_core_regs__bindgen_ty_27,
    pub __bindgen_anon_28: vcpu_guest_core_regs__bindgen_ty_28,
    pub __bindgen_anon_29: vcpu_guest_core_regs__bindgen_ty_29,
    pub __bindgen_anon_30: vcpu_guest_core_regs__bindgen_ty_30,
    pub __bindgen_anon_31: vcpu_guest_core_regs__bindgen_ty_31,
    pub __bindgen_anon_32: vcpu_guest_core_regs__bindgen_ty_32,
    pub cpsr: u64,
    pub __bindgen_anon_33: vcpu_guest_core_regs__bindgen_ty_33,
    pub spsr_fiq: u32,
    pub spsr_irq: u32,
    pub spsr_und: u32,
    pub spsr_abt: u32,
    pub sp_el0: u64,
    pub sp_el1: u64,
    pub elr_el1: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_1 {
    pub x0: u64,
    pub r0_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_1>())).x0 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_1),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_1>())).r0_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_1),
            "::",
            stringify!(r0_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_2 {
    pub x1: u64,
    pub r1_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_2>())).x1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_2),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_2>())).r1_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_2),
            "::",
            stringify!(r1_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_3 {
    pub x2: u64,
    pub r2_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_3>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_3>())).x2 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_3),
            "::",
            stringify!(x2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_3>())).r2_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_3),
            "::",
            stringify!(r2_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_4 {
    pub x3: u64,
    pub r3_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_4>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_4>())).x3 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_4),
            "::",
            stringify!(x3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_4>())).r3_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_4),
            "::",
            stringify!(r3_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_5 {
    pub x4: u64,
    pub r4_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_5>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_5>())).x4 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_5),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_5>())).r4_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_5),
            "::",
            stringify!(r4_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_6 {
    pub x5: u64,
    pub r5_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_6>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_6>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_6>())).x5 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_6),
            "::",
            stringify!(x5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_6>())).r5_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_6),
            "::",
            stringify!(r5_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_7 {
    pub x6: u64,
    pub r6_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_7>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_7>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_7)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_7>())).x6 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_7),
            "::",
            stringify!(x6)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_7>())).r6_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_7),
            "::",
            stringify!(r6_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_8 {
    pub x7: u64,
    pub r7_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_8>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_8>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_8>())).x7 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_8),
            "::",
            stringify!(x7)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_8>())).r7_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_8),
            "::",
            stringify!(r7_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_9 {
    pub x8: u64,
    pub r8_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_9>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_9>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_9)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_9>())).x8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_9),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_9>())).r8_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_9),
            "::",
            stringify!(r8_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_10 {
    pub x9: u64,
    pub r9_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_10>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_10>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_10)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_10>())).x9 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_10),
            "::",
            stringify!(x9)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_10>())).r9_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_10),
            "::",
            stringify!(r9_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_11 {
    pub x10: u64,
    pub r10_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_11>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_11>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_11>())).x10 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_11),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_11>())).r10_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_11),
            "::",
            stringify!(r10_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_12 {
    pub x11: u64,
    pub r11_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_12>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_12>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_12>())).x11 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_12),
            "::",
            stringify!(x11)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_12>())).r11_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_12),
            "::",
            stringify!(r11_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_13 {
    pub x12: u64,
    pub r12_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_13>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_13>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_13)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_13>())).x12 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_13),
            "::",
            stringify!(x12)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_13>())).r12_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_13),
            "::",
            stringify!(r12_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_14 {
    pub x13: u64,
    pub sp_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_14>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_14>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_14)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_14>())).x13 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_14),
            "::",
            stringify!(x13)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_14>())).sp_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_14),
            "::",
            stringify!(sp_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_15 {
    pub x14: u64,
    pub lr_usr: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_15>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_15>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_15)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_15>())).x14 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_15),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_15>())).lr_usr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_15),
            "::",
            stringify!(lr_usr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_16 {
    pub x15: u64,
    pub __unused_sp_hyp: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_16>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_16>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_16>())).x15 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_16),
            "::",
            stringify!(x15)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_16>())).__unused_sp_hyp
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_16),
            "::",
            stringify!(__unused_sp_hyp)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_17 {
    pub x16: u64,
    pub lr_irq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_17() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_17>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_17>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_17)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_17>())).x16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_17),
            "::",
            stringify!(x16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_17>())).lr_irq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_17),
            "::",
            stringify!(lr_irq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_18 {
    pub x17: u64,
    pub sp_irq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_18() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_18>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_18>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_18)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_18>())).x17 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_18),
            "::",
            stringify!(x17)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_18>())).sp_irq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_18),
            "::",
            stringify!(sp_irq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_19 {
    pub x18: u64,
    pub lr_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_19() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_19>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_19))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_19>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_19)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_19>())).x18 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_19),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_19>())).lr_svc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_19),
            "::",
            stringify!(lr_svc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_20 {
    pub x19: u64,
    pub sp_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_20() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_20>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_20))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_20>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_20)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_20>())).x19 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_20),
            "::",
            stringify!(x19)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_20>())).sp_svc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_20),
            "::",
            stringify!(sp_svc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_21 {
    pub x20: u64,
    pub lr_abt: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_21() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_21>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_21))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_21>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_21)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_21>())).x20 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_21),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_21>())).lr_abt as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_21),
            "::",
            stringify!(lr_abt)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_22 {
    pub x21: u64,
    pub sp_abt: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_22() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_22>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_22))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_22>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_22)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_22>())).x21 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_22),
            "::",
            stringify!(x21)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_22>())).sp_abt as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_22),
            "::",
            stringify!(sp_abt)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_23 {
    pub x22: u64,
    pub lr_und: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_23() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_23>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_23))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_23>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_23)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_23>())).x22 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_23),
            "::",
            stringify!(x22)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_23>())).lr_und as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_23),
            "::",
            stringify!(lr_und)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_24 {
    pub x23: u64,
    pub sp_und: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_24() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_24>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_24))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_24>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_24)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_24>())).x23 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_24),
            "::",
            stringify!(x23)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_24>())).sp_und as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_24),
            "::",
            stringify!(sp_und)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_25 {
    pub x24: u64,
    pub r8_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_25() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_25>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_25))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_25>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_25)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_25>())).x24 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_25),
            "::",
            stringify!(x24)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_25>())).r8_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_25),
            "::",
            stringify!(r8_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_26 {
    pub x25: u64,
    pub r9_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_26() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_26>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_26))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_26>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_26)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_26>())).x25 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_26),
            "::",
            stringify!(x25)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_26>())).r9_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_26),
            "::",
            stringify!(r9_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_27 {
    pub x26: u64,
    pub r10_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_27() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_27>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_27))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_27>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_27)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_27>())).x26 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_27),
            "::",
            stringify!(x26)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_27>())).r10_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_27),
            "::",
            stringify!(r10_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_28 {
    pub x27: u64,
    pub r11_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_28() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_28>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_28))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_28>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_28)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_28>())).x27 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_28),
            "::",
            stringify!(x27)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_28>())).r11_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_28),
            "::",
            stringify!(r11_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_29 {
    pub x28: u64,
    pub r12_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_29() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_29>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_29))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_29>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_29)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_29>())).x28 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_29),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_29>())).r12_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_29),
            "::",
            stringify!(r12_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_30 {
    pub x29: u64,
    pub sp_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_30() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_30>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_30))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_30>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_30)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_30>())).x29 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_30),
            "::",
            stringify!(x29)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_30>())).sp_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_30),
            "::",
            stringify!(sp_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_31 {
    pub x30: u64,
    pub lr_fiq: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_31() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_31>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_31))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_31>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_31)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_31>())).x30 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_31),
            "::",
            stringify!(x30)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_31>())).lr_fiq as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_31),
            "::",
            stringify!(lr_fiq)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_32 {
    pub pc64: u64,
    pub pc32: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_32() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_32>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_32))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_32>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_32)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_32>())).pc64 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_32),
            "::",
            stringify!(pc64)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_32>())).pc32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_32),
            "::",
            stringify!(pc32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union vcpu_guest_core_regs__bindgen_ty_33 {
    pub spsr_el1: u64,
    pub spsr_svc: u32,
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs__bindgen_ty_33() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs__bindgen_ty_33>(),
        8usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs__bindgen_ty_33))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs__bindgen_ty_33>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_33)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_33>())).spsr_el1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_33),
            "::",
            stringify!(spsr_el1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_guest_core_regs__bindgen_ty_33>())).spsr_svc as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs__bindgen_ty_33),
            "::",
            stringify!(spsr_svc)
        )
    );
}
#[test]
fn bindgen_test_layout_vcpu_guest_core_regs() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_core_regs>(),
        312usize,
        concat!("Size of: ", stringify!(vcpu_guest_core_regs))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_core_regs>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_guest_core_regs))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).cpsr as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(cpsr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).spsr_fiq as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(spsr_fiq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).spsr_irq as *const _ as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(spsr_irq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).spsr_und as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(spsr_und)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).spsr_abt as *const _ as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(spsr_abt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).sp_el0 as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(sp_el0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).sp_el1 as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(sp_el1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_core_regs>())).elr_el1 as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_core_regs),
            "::",
            stringify!(elr_el1)
        )
    );
}
pub type vcpu_guest_core_regs_t = vcpu_guest_core_regs;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_vcpu_guest_core_regs_t {
    pub p: *mut vcpu_guest_core_regs_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_vcpu_guest_core_regs_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_vcpu_guest_core_regs_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_vcpu_guest_core_regs_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_vcpu_guest_core_regs_t {
    pub p: *mut vcpu_guest_core_regs_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_vcpu_guest_core_regs_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_vcpu_guest_core_regs_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_vcpu_guest_core_regs_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_vcpu_guest_core_regs_t {
    pub p: *const vcpu_guest_core_regs_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_vcpu_guest_core_regs_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_vcpu_guest_core_regs_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_vcpu_guest_core_regs_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_vcpu_guest_core_regs_t {
    pub p: *const vcpu_guest_core_regs_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_vcpu_guest_core_regs_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_vcpu_guest_core_regs_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_vcpu_guest_core_regs_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_vcpu_guest_core_regs_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_vcpu_guest_core_regs_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct vcpu_guest_context {
    pub flags: u32,
    pub user_regs: vcpu_guest_core_regs,
    pub sctlr: u64,
    pub ttbcr: u64,
    pub ttbr0: u64,
    pub ttbr1: u64,
}
#[test]
fn bindgen_test_layout_vcpu_guest_context() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_guest_context>(),
        352usize,
        concat!("Size of: ", stringify!(vcpu_guest_context))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_guest_context>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_guest_context))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).user_regs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(user_regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).sctlr as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(sctlr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ttbcr as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ttbcr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ttbr0 as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ttbr0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_guest_context>())).ttbr1 as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_guest_context),
            "::",
            stringify!(ttbr1)
        )
    );
}
pub type vcpu_guest_context_t = vcpu_guest_context;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_vcpu_guest_context_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_vcpu_guest_context_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_vcpu_guest_context_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_vcpu_guest_context_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_vcpu_guest_context_t {
    pub p: *mut vcpu_guest_context_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_vcpu_guest_context_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_vcpu_guest_context_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_vcpu_guest_context_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_vcpu_guest_context_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_vcpu_guest_context_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_vcpu_guest_context_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_vcpu_guest_context_t {
    pub p: *const vcpu_guest_context_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_vcpu_guest_context_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_vcpu_guest_context_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_vcpu_guest_context_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_vcpu_guest_context_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_vcpu_guest_context_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_arch_domainconfig {
    pub gic_version: u8,
    pub tee_type: u16,
    pub nr_spis: u32,
    pub clock_frequency: u32,
}
#[test]
fn bindgen_test_layout_xen_arch_domainconfig() {
    assert_eq!(
        ::std::mem::size_of::<xen_arch_domainconfig>(),
        12usize,
        concat!("Size of: ", stringify!(xen_arch_domainconfig))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_arch_domainconfig>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_arch_domainconfig))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<xen_arch_domainconfig>())).gic_version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_arch_domainconfig),
            "::",
            stringify!(gic_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_arch_domainconfig>())).tee_type as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_arch_domainconfig),
            "::",
            stringify!(tee_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_arch_domainconfig>())).nr_spis as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_arch_domainconfig),
            "::",
            stringify!(nr_spis)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<xen_arch_domainconfig>())).clock_frequency as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_arch_domainconfig),
            "::",
            stringify!(clock_frequency)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_vcpu_info {}
#[test]
fn bindgen_test_layout_arch_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_vcpu_info>(),
        0usize,
        concat!("Size of: ", stringify!(arch_vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_vcpu_info>(),
        1usize,
        concat!("Alignment of ", stringify!(arch_vcpu_info))
    );
}
pub type arch_vcpu_info_t = arch_vcpu_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arch_shared_info {}
#[test]
fn bindgen_test_layout_arch_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<arch_shared_info>(),
        0usize,
        concat!("Size of: ", stringify!(arch_shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<arch_shared_info>(),
        1usize,
        concat!("Alignment of ", stringify!(arch_shared_info))
    );
}
pub type arch_shared_info_t = arch_shared_info;
pub type xen_callback_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_pmu_arch {
    pub dummy: u8,
}
#[test]
fn bindgen_test_layout_xen_pmu_arch() {
    assert_eq!(
        ::std::mem::size_of::<xen_pmu_arch>(),
        1usize,
        concat!("Size of: ", stringify!(xen_pmu_arch))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_pmu_arch>(),
        1usize,
        concat!("Alignment of ", stringify!(xen_pmu_arch))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_pmu_arch>())).dummy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_pmu_arch),
            "::",
            stringify!(dummy)
        )
    );
}
pub type xen_pmu_arch_t = xen_pmu_arch;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_char {
    pub p: *mut ::std::os::raw::c_char,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_char),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_char>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_char),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_char {
    pub p: *mut ::std::os::raw::c_char,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_char),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_char>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_char),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_char {
    pub p: *const ::std::os::raw::c_char,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_char),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_char>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_char),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_char {
    pub p: *const ::std::os::raw::c_char,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_char() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_char>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_char))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_char>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_char))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_char>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_char),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_char>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_char),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uchar),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uchar>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uchar),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uchar {
    pub p: *mut ::std::os::raw::c_uchar,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uchar),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uchar>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uchar),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uchar),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uchar>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uchar),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uchar {
    pub p: *const ::std::os::raw::c_uchar,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uchar() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uchar>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uchar))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uchar>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uchar))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uchar>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uchar),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uchar>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uchar),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_int {
    pub p: *mut ::std::os::raw::c_int,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_int),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_int>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_int),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_int {
    pub p: *mut ::std::os::raw::c_int,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_int),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_int>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_int),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_int {
    pub p: *const ::std::os::raw::c_int,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_int),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_int>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_int),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_int {
    pub p: *const ::std::os::raw::c_int,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_int() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_int>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_int))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_int>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_int))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_int>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_int),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_int>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_int),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint {
    pub p: *mut ::std::os::raw::c_uint,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint {
    pub p: *mut ::std::os::raw::c_uint,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint {
    pub p: *const ::std::os::raw::c_uint,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint {
    pub p: *const ::std::os::raw::c_uint,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uint>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uint>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_void {
    pub p: *mut ::std::os::raw::c_void,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_void),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_void>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_void),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_void {
    pub p: *mut ::std::os::raw::c_void,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_void),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_void>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_void),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_void {
    pub p: *const ::std::os::raw::c_void,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_void),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_void>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_void),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_void {
    pub p: *const ::std::os::raw::c_void,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_void() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_void>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_void))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_void>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_void>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_void),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_void>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_void),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint64_t {
    pub p: *mut u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint64_t {
    pub p: *mut u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint64_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint64_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint64_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint64_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint64_t {
    pub p: *const u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint64_t {
    pub p: *const u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint64_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint64_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint64_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_uint64_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint64_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint64_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint64_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint64_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_xen_pfn_t {
    pub p: *mut xen_pfn_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_pfn_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_pfn_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_pfn_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_pfn_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_xen_pfn_t {
    pub p: *mut xen_pfn_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_xen_pfn_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_xen_pfn_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_xen_pfn_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_xen_pfn_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_pfn_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_xen_pfn_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_pfn_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_pfn_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_pfn_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_xen_pfn_t {
    pub p: *const xen_pfn_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_xen_pfn_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_xen_pfn_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_xen_pfn_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_xen_pfn_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_xen_pfn_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_xen_pfn_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_xen_pfn_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_xen_pfn_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_xen_pfn_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_xen_ulong_t {
    pub p: *mut xen_ulong_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_xen_ulong_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_xen_ulong_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_ulong_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_xen_ulong_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_xen_ulong_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_xen_ulong_t {
    pub p: *mut xen_ulong_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_xen_ulong_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_xen_ulong_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_xen_ulong_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_xen_ulong_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_xen_ulong_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_xen_ulong_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_xen_ulong_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_ulong_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_xen_ulong_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_xen_ulong_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_xen_ulong_t {
    pub p: *const xen_ulong_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_xen_ulong_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_xen_ulong_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_xen_ulong_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_xen_ulong_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_xen_ulong_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_xen_ulong_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_xen_ulong_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_xen_ulong_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_xen_ulong_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mmuext_op {
    pub cmd: ::std::os::raw::c_uint,
    pub arg1: mmuext_op__bindgen_ty_1,
    pub arg2: mmuext_op__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_1 {
    pub mfn: xen_pfn_t,
    pub linear_addr: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_1>())).mfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_1),
            "::",
            stringify!(mfn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<mmuext_op__bindgen_ty_1>())).linear_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_1),
            "::",
            stringify!(linear_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mmuext_op__bindgen_ty_2 {
    pub nr_ents: ::std::os::raw::c_uint,
    pub vcpumask: __guest_handle_64_const_void,
    pub src_mfn: xen_pfn_t,
}
#[test]
fn bindgen_test_layout_mmuext_op__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(mmuext_op__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).nr_ents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(nr_ents)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).vcpumask as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(vcpumask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op__bindgen_ty_2>())).src_mfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op__bindgen_ty_2),
            "::",
            stringify!(src_mfn)
        )
    );
}
#[test]
fn bindgen_test_layout_mmuext_op() {
    assert_eq!(
        ::std::mem::size_of::<mmuext_op>(),
        24usize,
        concat!("Size of: ", stringify!(mmuext_op))
    );
    assert_eq!(
        ::std::mem::align_of::<mmuext_op>(),
        8usize,
        concat!("Alignment of ", stringify!(mmuext_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).arg1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(arg1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmuext_op>())).arg2 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mmuext_op),
            "::",
            stringify!(arg2)
        )
    );
}
pub type mmuext_op_t = mmuext_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_mmuext_op_t {
    pub p: *mut mmuext_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmuext_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmuext_op_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmuext_op_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmuext_op_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmuext_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_mmuext_op_t {
    pub p: *mut mmuext_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_mmuext_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_mmuext_op_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_mmuext_op_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_mmuext_op_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_mmuext_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmuext_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmuext_op_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmuext_op_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmuext_op_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmuext_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_mmuext_op_t {
    pub p: *const mmuext_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_mmuext_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_mmuext_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_mmuext_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_mmuext_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_mmuext_op_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_mmuext_op_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_mmuext_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_mmuext_op_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_mmuext_op_t),
            "::",
            stringify!(q)
        )
    );
}
pub type domid_t = u16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmu_update {
    pub ptr: u64,
    pub val: u64,
}
#[test]
fn bindgen_test_layout_mmu_update() {
    assert_eq!(
        ::std::mem::size_of::<mmu_update>(),
        16usize,
        concat!("Size of: ", stringify!(mmu_update))
    );
    assert_eq!(
        ::std::mem::align_of::<mmu_update>(),
        8usize,
        concat!("Alignment of ", stringify!(mmu_update))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmu_update>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmu_update),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmu_update>())).val as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mmu_update),
            "::",
            stringify!(val)
        )
    );
}
pub type mmu_update_t = mmu_update;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_mmu_update_t {
    pub p: *mut mmu_update_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_mmu_update_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_mmu_update_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmu_update_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_mmu_update_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_mmu_update_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_mmu_update_t {
    pub p: *mut mmu_update_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_mmu_update_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_mmu_update_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_mmu_update_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_mmu_update_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_mmu_update_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_mmu_update_t {
    pub p: *const mmu_update_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_mmu_update_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_mmu_update_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_mmu_update_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmu_update_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_mmu_update_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_mmu_update_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_mmu_update_t {
    pub p: *const mmu_update_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_mmu_update_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_mmu_update_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_mmu_update_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_mmu_update_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_mmu_update_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_mmu_update_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_mmu_update_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_mmu_update_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_mmu_update_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct multicall_entry {
    pub op: xen_ulong_t,
    pub result: xen_ulong_t,
    pub args: [xen_ulong_t; 6usize],
}
#[test]
fn bindgen_test_layout_multicall_entry() {
    assert_eq!(
        ::std::mem::size_of::<multicall_entry>(),
        64usize,
        concat!("Size of: ", stringify!(multicall_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<multicall_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(multicall_entry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).op as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).result as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<multicall_entry>())).args as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(multicall_entry),
            "::",
            stringify!(args)
        )
    );
}
pub type multicall_entry_t = multicall_entry;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_multicall_entry_t {
    pub p: *mut multicall_entry_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_multicall_entry_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_multicall_entry_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_multicall_entry_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_multicall_entry_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_multicall_entry_t {
    pub p: *mut multicall_entry_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_multicall_entry_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_multicall_entry_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_multicall_entry_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_multicall_entry_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_multicall_entry_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_multicall_entry_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_multicall_entry_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_multicall_entry_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_multicall_entry_t {
    pub p: *const multicall_entry_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_multicall_entry_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_multicall_entry_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_multicall_entry_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_multicall_entry_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_multicall_entry_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_multicall_entry_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_multicall_entry_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_multicall_entry_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_time_info {
    pub version: u32,
    pub pad0: u32,
    pub tsc_timestamp: u64,
    pub system_time: u64,
    pub tsc_to_system_mul: u32,
    pub tsc_shift: i8,
    pub flags: u8,
    pub pad1: [u8; 2usize],
}
#[test]
fn bindgen_test_layout_vcpu_time_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_time_info>(),
        32usize,
        concat!("Size of: ", stringify!(vcpu_time_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_time_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_time_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).pad0 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).tsc_timestamp as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).system_time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(system_time)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<vcpu_time_info>())).tsc_to_system_mul as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_to_system_mul)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).tsc_shift as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(tsc_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).flags as *const _ as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_time_info>())).pad1 as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_time_info),
            "::",
            stringify!(pad1)
        )
    );
}
pub type vcpu_time_info_t = vcpu_time_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct vcpu_info {
    pub evtchn_upcall_pending: u8,
    pub pad0: u8,
    pub evtchn_pending_sel: xen_ulong_t,
    pub arch: arch_vcpu_info,
    pub time: vcpu_time_info_t,
}
#[test]
fn bindgen_test_layout_vcpu_info() {
    assert_eq!(
        ::std::mem::size_of::<vcpu_info>(),
        48usize,
        concat!("Size of: ", stringify!(vcpu_info))
    );
    assert_eq!(
        ::std::mem::align_of::<vcpu_info>(),
        8usize,
        concat!("Alignment of ", stringify!(vcpu_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).evtchn_upcall_pending as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(evtchn_upcall_pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).pad0 as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).evtchn_pending_sel as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(evtchn_pending_sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).arch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(arch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<vcpu_info>())).time as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(vcpu_info),
            "::",
            stringify!(time)
        )
    );
}
pub type vcpu_info_t = vcpu_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct shared_info {
    pub vcpu_info: [vcpu_info; 1usize],
    pub evtchn_pending: [xen_ulong_t; 64usize],
    pub evtchn_mask: [xen_ulong_t; 64usize],
    pub wc_version: u32,
    pub wc_sec: u32,
    pub wc_nsec: u32,
    pub wc_sec_hi: u32,
    pub arch: arch_shared_info,
}
#[test]
fn bindgen_test_layout_shared_info() {
    assert_eq!(
        ::std::mem::size_of::<shared_info>(),
        1088usize,
        concat!("Size of: ", stringify!(shared_info))
    );
    assert_eq!(
        ::std::mem::align_of::<shared_info>(),
        8usize,
        concat!("Alignment of ", stringify!(shared_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).vcpu_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(vcpu_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).evtchn_pending as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(evtchn_pending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).evtchn_mask as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(evtchn_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_version as *const _ as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_sec as *const _ as usize },
        1076usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_nsec as *const _ as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_nsec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).wc_sec_hi as *const _ as usize },
        1084usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(wc_sec_hi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<shared_info>())).arch as *const _ as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(shared_info),
            "::",
            stringify!(arch)
        )
    );
}
pub type shared_info_t = shared_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_multiboot_mod_list {
    pub mod_start: u32,
    pub mod_end: u32,
    pub cmdline: u32,
    pub pad: u32,
}
#[test]
fn bindgen_test_layout_xen_multiboot_mod_list() {
    assert_eq!(
        ::std::mem::size_of::<xen_multiboot_mod_list>(),
        16usize,
        concat!("Size of: ", stringify!(xen_multiboot_mod_list))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_multiboot_mod_list>(),
        4usize,
        concat!("Alignment of ", stringify!(xen_multiboot_mod_list))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<xen_multiboot_mod_list>())).mod_start as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(mod_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).mod_end as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(mod_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).cmdline as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(cmdline)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_multiboot_mod_list>())).pad as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_multiboot_mod_list),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct dom0_vga_console_info {
    pub video_type: u8,
    pub u: dom0_vga_console_info__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union dom0_vga_console_info__bindgen_ty_1 {
    pub text_mode_3: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1,
    pub vesa_lfb: dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1 {
    pub font_height: u16,
    pub cursor_x: u16,
    pub cursor_y: u16,
    pub rows: u16,
    pub columns: u16,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        10usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>()))
                .font_height as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(font_height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).cursor_x
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cursor_x)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).cursor_y
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(cursor_y)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).rows
                as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rows)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1>())).columns
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(columns)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2 {
    pub width: u16,
    pub height: u16,
    pub bytes_per_line: u16,
    pub bits_per_pixel: u16,
    pub lfb_base: u32,
    pub lfb_size: u32,
    pub red_pos: u8,
    pub red_size: u8,
    pub green_pos: u8,
    pub green_size: u8,
    pub blue_pos: u8,
    pub blue_size: u8,
    pub rsvd_pos: u8,
    pub rsvd_size: u8,
    pub gbl_caps: u32,
    pub mode_attrs: u16,
    pub pad: u16,
    pub ext_lfb_base: u32,
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        36usize,
        concat!(
            "Size of: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).width
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).height
                as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>()))
                .bytes_per_line as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bytes_per_line)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>()))
                .bits_per_pixel as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bits_per_pixel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).lfb_base
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lfb_base)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).lfb_size
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(lfb_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).red_pos
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(red_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).red_size
                as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(red_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).green_pos
                as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(green_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).green_size
                as *const _ as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(green_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).blue_pos
                as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(blue_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).blue_size
                as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(blue_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).rsvd_pos
                as *const _ as usize
        },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rsvd_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).rsvd_size
                as *const _ as usize
        },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(rsvd_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).gbl_caps
                as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(gbl_caps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).mode_attrs
                as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(mode_attrs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>())).pad
                as *const _ as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(pad)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2>()))
                .ext_lfb_base as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(ext_lfb_base)
        )
    );
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info__bindgen_ty_1>(),
        36usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(dom0_vga_console_info__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1>())).text_mode_3 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1),
            "::",
            stringify!(text_mode_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info__bindgen_ty_1>())).vesa_lfb as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info__bindgen_ty_1),
            "::",
            stringify!(vesa_lfb)
        )
    );
}
#[test]
fn bindgen_test_layout_dom0_vga_console_info() {
    assert_eq!(
        ::std::mem::size_of::<dom0_vga_console_info>(),
        40usize,
        concat!("Size of: ", stringify!(dom0_vga_console_info))
    );
    assert_eq!(
        ::std::mem::align_of::<dom0_vga_console_info>(),
        4usize,
        concat!("Alignment of ", stringify!(dom0_vga_console_info))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<dom0_vga_console_info>())).video_type as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info),
            "::",
            stringify!(video_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<dom0_vga_console_info>())).u as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(dom0_vga_console_info),
            "::",
            stringify!(u)
        )
    );
}
pub type dom0_vga_console_info_t = dom0_vga_console_info;
pub type xen_domain_handle_t = [u8; 16usize];
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint8 {
    pub p: *mut u8,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint8),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint8>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint8),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint8 {
    pub p: *mut u8,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint8),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint8>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint8),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint8 {
    pub p: *const u8,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint8),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint8>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint8),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint8 {
    pub p: *const u8,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint8() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint8>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint8))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint8>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint8))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uint8>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint8),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_const_uint8>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint8),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint16 {
    pub p: *mut u16,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint16>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint16),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint16>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint16),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint16 {
    pub p: *mut u16,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint16>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint16),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint16>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint16),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint16 {
    pub p: *const u16,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint16>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint16),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint16>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint16),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint16 {
    pub p: *const u16,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint16() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint16>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint16))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint16>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint16))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint16>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint16),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint16>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint16),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint32 {
    pub p: *mut u32,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint32>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint32),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint32>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint32),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint32 {
    pub p: *mut u32,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint32>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint32),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint32>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint32),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint32 {
    pub p: *const u32,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint32>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint32),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint32>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint32),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint32 {
    pub p: *const u32,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint32() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint32>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint32))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint32>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint32))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint32>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint32),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint32>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint32),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_uint64 {
    pub p: *mut u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_uint64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_uint64>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_uint64),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_uint64 {
    pub p: *mut u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_uint64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint64>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint64),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_uint64>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_uint64),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_uint64 {
    pub p: *const u64,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_const_uint64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_const_uint64>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_uint64),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_uint64 {
    pub p: *const u64,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_uint64() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_uint64>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_uint64))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_uint64>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_const_uint64))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint64>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint64),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_uint64>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_uint64),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct xen_uuid_t {
    pub a: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_xen_uuid_t() {
    assert_eq!(
        ::std::mem::size_of::<xen_uuid_t>(),
        16usize,
        concat!("Size of: ", stringify!(xen_uuid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<xen_uuid_t>(),
        1usize,
        concat!("Alignment of ", stringify!(xen_uuid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xen_uuid_t>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xen_uuid_t),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct xenctl_bitmap {
    pub bitmap: __guest_handle_64_uint8,
    pub nr_bits: u32,
}
#[test]
fn bindgen_test_layout_xenctl_bitmap() {
    assert_eq!(
        ::std::mem::size_of::<xenctl_bitmap>(),
        16usize,
        concat!("Size of: ", stringify!(xenctl_bitmap))
    );
    assert_eq!(
        ::std::mem::align_of::<xenctl_bitmap>(),
        8usize,
        concat!("Alignment of ", stringify!(xenctl_bitmap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xenctl_bitmap>())).bitmap as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(xenctl_bitmap),
            "::",
            stringify!(bitmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<xenctl_bitmap>())).nr_bits as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(xenctl_bitmap),
            "::",
            stringify!(nr_bits)
        )
    );
}
pub type xenctl_bitmap_t = xenctl_bitmap;
pub type evtchn_port_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_evtchn_port_t {
    pub p: *mut evtchn_port_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_evtchn_port_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_evtchn_port_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_evtchn_port_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_evtchn_port_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_evtchn_port_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_evtchn_port_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_evtchn_port_t {
    pub p: *mut evtchn_port_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_evtchn_port_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_evtchn_port_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_evtchn_port_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_evtchn_port_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_evtchn_port_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_evtchn_port_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_evtchn_port_t {
    pub p: *const evtchn_port_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_evtchn_port_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_evtchn_port_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_evtchn_port_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_evtchn_port_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_evtchn_port_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_evtchn_port_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_evtchn_port_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_evtchn_port_t {
    pub p: *const evtchn_port_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_evtchn_port_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_evtchn_port_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_evtchn_port_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_evtchn_port_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_evtchn_port_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_evtchn_port_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_evtchn_port_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_evtchn_port_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_alloc_unbound {
    pub dom: domid_t,
    pub remote_dom: domid_t,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_alloc_unbound() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_alloc_unbound>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_alloc_unbound))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_alloc_unbound>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_alloc_unbound))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_alloc_unbound>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_alloc_unbound),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_alloc_unbound>())).remote_dom as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_alloc_unbound),
            "::",
            stringify!(remote_dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_alloc_unbound>())).port as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_alloc_unbound),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_alloc_unbound_t = evtchn_alloc_unbound;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_interdomain {
    pub remote_dom: domid_t,
    pub remote_port: evtchn_port_t,
    pub local_port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_interdomain() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_interdomain>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_interdomain))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_interdomain>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_interdomain))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_bind_interdomain>())).remote_dom as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_interdomain),
            "::",
            stringify!(remote_dom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_bind_interdomain>())).remote_port as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_interdomain),
            "::",
            stringify!(remote_port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_bind_interdomain>())).local_port as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_interdomain),
            "::",
            stringify!(local_port)
        )
    );
}
pub type evtchn_bind_interdomain_t = evtchn_bind_interdomain;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_virq {
    pub virq: u32,
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_virq() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_virq>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_virq))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_virq>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_virq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_virq>())).virq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_virq),
            "::",
            stringify!(virq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_virq>())).vcpu as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_virq),
            "::",
            stringify!(vcpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_virq>())).port as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_virq),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_bind_virq_t = evtchn_bind_virq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_pirq {
    pub pirq: u32,
    pub flags: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_pirq() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_pirq>(),
        12usize,
        concat!("Size of: ", stringify!(evtchn_bind_pirq))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_pirq>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_pirq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_pirq>())).pirq as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_pirq),
            "::",
            stringify!(pirq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_pirq>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_pirq),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_pirq>())).port as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_pirq),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_bind_pirq_t = evtchn_bind_pirq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_ipi {
    pub vcpu: u32,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_bind_ipi() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_ipi>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_bind_ipi))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_ipi>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_ipi))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_ipi>())).vcpu as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_ipi),
            "::",
            stringify!(vcpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_ipi>())).port as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_ipi),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_bind_ipi_t = evtchn_bind_ipi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_close {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_close() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_close>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_close))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_close>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_close))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_close>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_close),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_close_t = evtchn_close;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_send {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_send() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_send>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_send))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_send>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_send))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_send>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_send),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_send_t = evtchn_send;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_status {
    pub dom: domid_t,
    pub port: evtchn_port_t,
    pub status: u32,
    pub vcpu: u32,
    pub u: evtchn_status__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_status__bindgen_ty_1 {
    pub unbound: evtchn_status__bindgen_ty_1__bindgen_ty_1,
    pub interdomain: evtchn_status__bindgen_ty_1__bindgen_ty_2,
    pub pirq: u32,
    pub virq: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_1 {
    pub dom: domid_t,
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1__bindgen_ty_1>())).dom as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(dom)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_status__bindgen_ty_1__bindgen_ty_2 {
    pub dom: domid_t,
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1__bindgen_ty_2>())).dom as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1__bindgen_ty_2>())).port as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(port)
        )
    );
}
#[test]
fn bindgen_test_layout_evtchn_status__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_status__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_status__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1>())).unbound as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1),
            "::",
            stringify!(unbound)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1>())).interdomain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1),
            "::",
            stringify!(interdomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1>())).pirq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1),
            "::",
            stringify!(pirq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_status__bindgen_ty_1>())).virq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status__bindgen_ty_1),
            "::",
            stringify!(virq)
        )
    );
}
#[test]
fn bindgen_test_layout_evtchn_status() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_status>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_status))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_status>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_status))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_status>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_status>())).port as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_status>())).status as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_status>())).vcpu as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status),
            "::",
            stringify!(vcpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_status>())).u as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_status),
            "::",
            stringify!(u)
        )
    );
}
pub type evtchn_status_t = evtchn_status;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_bind_vcpu {
    pub port: evtchn_port_t,
    pub vcpu: u32,
}
#[test]
fn bindgen_test_layout_evtchn_bind_vcpu() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_bind_vcpu>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_bind_vcpu))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_bind_vcpu>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_bind_vcpu))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_vcpu>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_vcpu),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_bind_vcpu>())).vcpu as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_bind_vcpu),
            "::",
            stringify!(vcpu)
        )
    );
}
pub type evtchn_bind_vcpu_t = evtchn_bind_vcpu;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_unmask {
    pub port: evtchn_port_t,
}
#[test]
fn bindgen_test_layout_evtchn_unmask() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_unmask>(),
        4usize,
        concat!("Size of: ", stringify!(evtchn_unmask))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_unmask>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_unmask))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_unmask>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_unmask),
            "::",
            stringify!(port)
        )
    );
}
pub type evtchn_unmask_t = evtchn_unmask;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_reset {
    pub dom: domid_t,
}
#[test]
fn bindgen_test_layout_evtchn_reset() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_reset>(),
        2usize,
        concat!("Size of: ", stringify!(evtchn_reset))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_reset>(),
        2usize,
        concat!("Alignment of ", stringify!(evtchn_reset))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_reset>())).dom as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_reset),
            "::",
            stringify!(dom)
        )
    );
}
pub type evtchn_reset_t = evtchn_reset;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_init_control {
    pub control_gfn: u64,
    pub offset: u32,
    pub vcpu: u32,
    pub link_bits: u8,
    pub _pad: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_evtchn_init_control() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_init_control>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_init_control))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_init_control>(),
        8usize,
        concat!("Alignment of ", stringify!(evtchn_init_control))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_init_control>())).control_gfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_init_control),
            "::",
            stringify!(control_gfn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_init_control>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_init_control),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_init_control>())).vcpu as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_init_control),
            "::",
            stringify!(vcpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_init_control>())).link_bits as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_init_control),
            "::",
            stringify!(link_bits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_init_control>()))._pad as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_init_control),
            "::",
            stringify!(_pad)
        )
    );
}
pub type evtchn_init_control_t = evtchn_init_control;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_expand_array {
    pub array_gfn: u64,
}
#[test]
fn bindgen_test_layout_evtchn_expand_array() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_expand_array>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_expand_array))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_expand_array>(),
        8usize,
        concat!("Alignment of ", stringify!(evtchn_expand_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_expand_array>())).array_gfn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_expand_array),
            "::",
            stringify!(array_gfn)
        )
    );
}
pub type evtchn_expand_array_t = evtchn_expand_array;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_set_priority {
    pub port: evtchn_port_t,
    pub priority: u32,
}
#[test]
fn bindgen_test_layout_evtchn_set_priority() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_set_priority>(),
        8usize,
        concat!("Size of: ", stringify!(evtchn_set_priority))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_set_priority>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_set_priority))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_set_priority>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_set_priority),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_set_priority>())).priority as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_set_priority),
            "::",
            stringify!(priority)
        )
    );
}
pub type evtchn_set_priority_t = evtchn_set_priority;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct evtchn_op {
    pub cmd: u32,
    pub u: evtchn_op__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union evtchn_op__bindgen_ty_1 {
    pub alloc_unbound: evtchn_alloc_unbound_t,
    pub bind_interdomain: evtchn_bind_interdomain_t,
    pub bind_virq: evtchn_bind_virq_t,
    pub bind_pirq: evtchn_bind_pirq_t,
    pub bind_ipi: evtchn_bind_ipi_t,
    pub close: evtchn_close_t,
    pub send: evtchn_send_t,
    pub status: evtchn_status_t,
    pub bind_vcpu: evtchn_bind_vcpu_t,
    pub unmask: evtchn_unmask_t,
}
#[test]
fn bindgen_test_layout_evtchn_op__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_op__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(evtchn_op__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_op__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_op__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).alloc_unbound as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(alloc_unbound)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).bind_interdomain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(bind_interdomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).bind_virq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(bind_virq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).bind_pirq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(bind_pirq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).bind_ipi as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(bind_ipi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).close as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).send as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(send)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).bind_vcpu as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(bind_vcpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op__bindgen_ty_1>())).unmask as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op__bindgen_ty_1),
            "::",
            stringify!(unmask)
        )
    );
}
#[test]
fn bindgen_test_layout_evtchn_op() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_op>(),
        28usize,
        concat!("Size of: ", stringify!(evtchn_op))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_op>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_op))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op>())).cmd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_op>())).u as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_op),
            "::",
            stringify!(u)
        )
    );
}
pub type evtchn_op_t = evtchn_op;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_evtchn_op_t {
    pub p: *mut evtchn_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_evtchn_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_evtchn_op_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_evtchn_op_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_evtchn_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_evtchn_op_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_evtchn_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_evtchn_op_t {
    pub p: *mut evtchn_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_evtchn_op_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__guest_handle_64_evtchn_op_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_evtchn_op_t>())).p as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_evtchn_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__guest_handle_64_evtchn_op_t>())).q as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_evtchn_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_evtchn_op_t {
    pub p: *const evtchn_op_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_const_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_evtchn_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_evtchn_op_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_evtchn_op_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_evtchn_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_evtchn_op_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_evtchn_op_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_evtchn_op_t {
    pub p: *const evtchn_op_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_evtchn_op_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_evtchn_op_t>(),
        8usize,
        concat!("Size of: ", stringify!(__guest_handle_64_const_evtchn_op_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_evtchn_op_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_evtchn_op_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_evtchn_op_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_evtchn_op_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_evtchn_op_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_evtchn_op_t),
            "::",
            stringify!(q)
        )
    );
}
pub type event_word_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evtchn_fifo_control_block {
    pub ready: u32,
    pub _rsvd: u32,
    pub head: [u32; 16usize],
}
#[test]
fn bindgen_test_layout_evtchn_fifo_control_block() {
    assert_eq!(
        ::std::mem::size_of::<evtchn_fifo_control_block>(),
        72usize,
        concat!("Size of: ", stringify!(evtchn_fifo_control_block))
    );
    assert_eq!(
        ::std::mem::align_of::<evtchn_fifo_control_block>(),
        4usize,
        concat!("Alignment of ", stringify!(evtchn_fifo_control_block))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_fifo_control_block>())).ready as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_fifo_control_block),
            "::",
            stringify!(ready)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_fifo_control_block>()))._rsvd as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_fifo_control_block),
            "::",
            stringify!(_rsvd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evtchn_fifo_control_block>())).head as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evtchn_fifo_control_block),
            "::",
            stringify!(head)
        )
    );
}
pub type evtchn_fifo_control_block_t = evtchn_fifo_control_block;
pub type grant_ref_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v1 {
    pub flags: u16,
    pub domid: domid_t,
    pub frame: u32,
}
#[test]
fn bindgen_test_layout_grant_entry_v1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v1>(),
        8usize,
        concat!("Size of: ", stringify!(grant_entry_v1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v1>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).domid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(domid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v1>())).frame as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v1),
            "::",
            stringify!(frame)
        )
    );
}
pub type grant_entry_v1_t = grant_entry_v1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_header {
    pub flags: u16,
    pub domid: domid_t,
}
#[test]
fn bindgen_test_layout_grant_entry_header() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_header>(),
        4usize,
        concat!("Size of: ", stringify!(grant_entry_header))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_header>(),
        2usize,
        concat!("Alignment of ", stringify!(grant_entry_header))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_header>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_header),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_header>())).domid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_header),
            "::",
            stringify!(domid)
        )
    );
}
pub type grant_entry_header_t = grant_entry_header;
#[repr(C)]
#[derive(Copy, Clone)]
pub union grant_entry_v2 {
    pub hdr: grant_entry_header_t,
    pub full_page: grant_entry_v2__bindgen_ty_1,
    pub sub_page: grant_entry_v2__bindgen_ty_2,
    pub transitive: grant_entry_v2__bindgen_ty_3,
    pub __spacer: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_1 {
    pub hdr: grant_entry_header_t,
    pub pad0: u32,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).pad0 as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_1>())).frame as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_1),
            "::",
            stringify!(frame)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_2 {
    pub hdr: grant_entry_header_t,
    pub page_off: u16,
    pub length: u16,
    pub frame: u64,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).page_off as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(page_off)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).length as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_2>())).frame as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_2),
            "::",
            stringify!(frame)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grant_entry_v2__bindgen_ty_3 {
    pub hdr: grant_entry_header_t,
    pub trans_domid: domid_t,
    pub pad0: u16,
    pub gref: grant_ref_t,
}
#[test]
fn bindgen_test_layout_grant_entry_v2__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2__bindgen_ty_3>(),
        12usize,
        concat!("Size of: ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(grant_entry_v2__bindgen_ty_3))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).hdr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).trans_domid as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(trans_domid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).pad0 as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(pad0)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<grant_entry_v2__bindgen_ty_3>())).gref as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2__bindgen_ty_3),
            "::",
            stringify!(gref)
        )
    );
}
#[test]
fn bindgen_test_layout_grant_entry_v2() {
    assert_eq!(
        ::std::mem::size_of::<grant_entry_v2>(),
        16usize,
        concat!("Size of: ", stringify!(grant_entry_v2))
    );
    assert_eq!(
        ::std::mem::align_of::<grant_entry_v2>(),
        8usize,
        concat!("Alignment of ", stringify!(grant_entry_v2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).hdr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).full_page as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(full_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).sub_page as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(sub_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).transitive as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(transitive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grant_entry_v2>())).__spacer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grant_entry_v2),
            "::",
            stringify!(__spacer)
        )
    );
}
pub type grant_entry_v2_t = grant_entry_v2;
pub type grant_status_t = u16;
pub type grant_handle_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_map_grant_ref {
    pub host_addr: u64,
    pub flags: u32,
    pub ref_: grant_ref_t,
    pub dom: domid_t,
    pub status: i16,
    pub handle: grant_handle_t,
    pub dev_bus_addr: u64,
}
#[test]
fn bindgen_test_layout_gnttab_map_grant_ref() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_map_grant_ref>(),
        32usize,
        concat!("Size of: ", stringify!(gnttab_map_grant_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_map_grant_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_map_grant_ref))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).host_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(host_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).ref_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).dom as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(dom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).status as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_map_grant_ref>())).handle as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_map_grant_ref>())).dev_bus_addr as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_map_grant_ref),
            "::",
            stringify!(dev_bus_addr)
        )
    );
}
pub type gnttab_map_grant_ref_t = gnttab_map_grant_ref;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_gnttab_map_grant_ref_t {
    pub p: *mut gnttab_map_grant_ref_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_map_grant_ref_t>())).p as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_map_grant_ref_t>())).q as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_map_grant_ref_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_gnttab_map_grant_ref_t {
    pub p: *mut gnttab_map_grant_ref_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_gnttab_map_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_gnttab_map_grant_ref_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_gnttab_map_grant_ref_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_const_gnttab_map_grant_ref_t {
    pub p: *const gnttab_map_grant_ref_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_const_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_map_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_const_gnttab_map_grant_ref_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_const_gnttab_map_grant_ref_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_64_const_gnttab_map_grant_ref_t {
    pub p: *const gnttab_map_grant_ref_t,
    pub q: u64,
}
#[test]
fn bindgen_test_layout___guest_handle_64_const_gnttab_map_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_64_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_64_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_64_const_gnttab_map_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_64_const_gnttab_map_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_gnttab_map_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_gnttab_map_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_64_const_gnttab_map_grant_ref_t>())).q as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_64_const_gnttab_map_grant_ref_t),
            "::",
            stringify!(q)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gnttab_unmap_grant_ref {
    pub host_addr: u64,
    pub dev_bus_addr: u64,
    pub handle: grant_handle_t,
    pub status: i16,
}
#[test]
fn bindgen_test_layout_gnttab_unmap_grant_ref() {
    assert_eq!(
        ::std::mem::size_of::<gnttab_unmap_grant_ref>(),
        24usize,
        concat!("Size of: ", stringify!(gnttab_unmap_grant_ref))
    );
    assert_eq!(
        ::std::mem::align_of::<gnttab_unmap_grant_ref>(),
        8usize,
        concat!("Alignment of ", stringify!(gnttab_unmap_grant_ref))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).host_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(host_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).dev_bus_addr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(dev_bus_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<gnttab_unmap_grant_ref>())).status as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(gnttab_unmap_grant_ref),
            "::",
            stringify!(status)
        )
    );
}
pub type gnttab_unmap_grant_ref_t = gnttab_unmap_grant_ref;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __guest_handle_gnttab_unmap_grant_ref_t {
    pub p: *mut gnttab_unmap_grant_ref_t,
    pub q: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout___guest_handle_gnttab_unmap_grant_ref_t() {
    assert_eq!(
        ::std::mem::size_of::<__guest_handle_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__guest_handle_gnttab_unmap_grant_ref_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_unmap_grant_ref_t>())).p as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__guest_handle_gnttab_unmap_grant_ref_t),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__guest_handle_gnttab_unmap_grant_ref_t>())).q as *const _
